CSI API ETABS v1

# cSapModelLineElm Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cLineElm LineElm { get; }

    ReadOnly Property LineElm As cLineElm
    	Get

    Dim instance As cSapModel
    Dim value As cLineElm

    value = instance.LineElm

    property cLineElm^ LineElm {
    	cLineElm^ get ();
    }

    abstract LineElm : cLineElm with get

#### Property Value

Type: cLineElm

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com